## 2. Pandas

In [1]:
%pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Collecting pandas
  Obtaining dependency information for pandas from https://files.pythonhosted.org/packages/71/00/6beaeeba7f075d15ea167a5caa039b861e58ff2f58a5b659abb9b544c8f6/pandas-2.2.1-cp312-cp312-win_amd64.whl.metadata
  Downloading pandas-2.2.1-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy<2,>=1.26.0 in c:\users\박민호\appdata\roaming\python\python312\site-packages (from pandas) (1.26.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\박민호\appdata\roaming\python\python312\site-packages (from pandas) (2.8.2)
Collecting pytz>=2020.1 (from pandas)
  Obtaining dependency information for pytz>=2020.1 from https://files.pythonhosted.org/packages/9c/3d/a121f284241f08268b21359bd425f7d4825cffc5ac5cd0e1b3d82ffd2b10/pytz-2024.1-py2.py3-none-any.whl.metadata
  Downloading pytz-2024.1-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Obtaining dependency information for tzdata>=2022.7 from https://files.pythonhosted.org/packages/65/58/f9c9e6be752e9fcb8b6a0ee9fb87e6e7a1f6bcab2cdc73f02bb7ba91ada0/tzdata-2024.1-py2.py3-none-any.whl.metadata
  Downloading tzdata-2024.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\박민호\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.2.1-cp312-cp312-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
    --------------------------------------- 0.2/11.5 MB 6.6 MB/s eta 0:00:02
   -- ------------------------------------- 0.7/11.5 MB 10.7 MB/s eta 0:00:02
   ---- ----------------------------------- 1.2/11.5 MB 13.1 MB/s eta 0:00:01
   ------ --------------------------------- 1.9/11.5 MB 14.8 MB/s eta 0:00:01
   -------- ------------------------------- 2.5/11.5 MB 14.3 MB/s eta 0:00:01
   ---------- ----------------------------- 3.1/11.5 MB 15.4 MB/s eta 0:00:01
   ------------- -------------------------- 3.8/11.5 MB 16.0 MB/s eta 0:00:01
   -------------- ------------------------- 4.2/11.5 MB 15.8 MB/s eta 0:00:01
   ---------------- ----------------------- 4.7/11.5 MB 14.9 MB/s eta 0:00:01
   ------------------ --------------------- 5.3/11.5 MB 15.3 MB/s eta 0:00:01
   -------------------- ------------------- 5.9/11.5 MB 15.1 MB/s eta 0:00:01
   ---------------------- ----------------- 6.6/11.5 MB 15.6 MB/s eta 0:00:01
   ------------------------- -------------- 7.3/11.5 MB 16.0 MB/s eta 0:00:01
   ---------------------------- ----------- 8.0/11.5 MB 16.1 MB/s eta 0:00:01
   ------------------------------ --------- 8.8/11.5 MB 16.6 MB/s eta 0:00:01
   --------------------------------- ------ 9.6/11.5 MB 17.0 MB/s eta 0:00:01
   ------------------------------------ --- 10.4/11.5 MB 17.7 MB/s eta 0:00:01
   ---------------------------------------  11.2/11.5 MB 18.2 MB/s eta 0:00:01
   ---------------------------------------  11.5/11.5 MB 18.2 MB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 16.8 MB/s eta 0:00:00
Downloading pytz-2024.1-py2.py3-none-any.whl (505 kB)
   ---------------------------------------- 0.0/505.5 kB ? eta -:--:--
   --------------------------------------- 505.5/505.5 kB 15.5 MB/s eta 0:00:00
Downloading tzdata-2024.1-py2.py3-none-any.whl (345 kB)
   ---------------------------------------- 0.0/345.4 kB ? eta -:--:--
   --------------------------------------- 345.4/345.4 kB 20.9 MB/s eta 0:00:00
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.1 pytz-2024.1 tzdata-2024.1
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.2.1 -> 24.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
import pandas as pd

In [13]:
# Series
data = ['a', 'b', 'c', 'd', 'e']

se = pd.Series(data)

type(se)
se.index
se.values

se[0]

se.name = 'alphabet'
se.index.name = 'index'
print(se)

index
0    a
1    b
2    c
3    d
4    e
Name: alphabet, dtype: object

In [31]:
# DF (DataFrame = Excel)
data = {'country' : ['kor', 'usa', 'chn', 'jpn'], 'rank' : [1,2,3,4], 'grade' : ['A', 'B', 'C', 'D']}

df = pd.DataFrame(data) # csv to json, json to csv, xlsx
df

  country  rank grade
0     kor     1     A
1     usa     2     B
2     chn     3     C
3     jpn     4     D

In [32]:
# Data Selection -> Data를 불러오는 방법
# (1) df.컬럼, df['컬럼']

df.grade # 불러오고 싶은 부분 하나만 가능

df[['country', 'grade']] # 리스트화 시켜서 여러개 볼 수 있음

  country grade
0     kor     A
1     usa     B
2     chn     C
3     jpn     D

In [33]:
# (2) df.loc[인덱스값, 컬럼명], 전체는 대괄호 안에 콜론을 넣으면 된다.
df.loc[:, ['grade', 'country']]

  grade country
0     A     kor
1     B     usa
2     C     chn
3     D     jpn

In [34]:
# 삭제하는 방법 (drop)
# (1) 단순하게 행 데이터를 삭제하는 방법

df.drop([3], inplace=True) # 수정하는 부분에서 허용을 하려면 inplace=True 를 넣어야 한다. (다른 방법도 있음)
df

  country  rank grade
0     kor     1     A
1     usa     2     B
2     chn     3     C

In [35]:
# (2) 컬럼을 삭제
df = df.drop('rank', axis=1)
df

  country grade
0     kor     A
1     usa     B
2     chn     C

In [36]:
df['rank'] = [1,2,3] # 이렇게 해당 컬럼부분 값을 새로 선언해도 수정이 가능하다.
df

  country grade  rank
0     kor     A     1
1     usa     B     2
2     chn     C     3

In [38]:
# 기술통계
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   country  3 non-null      object
 1   grade    3 non-null      object
 2   rank     3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

       rank
count   3.0
mean    2.0
std     1.0
min     1.0
25%     1.5
50%     2.0
75%     2.5
max     3.0

In [52]:
# 데이터 정렬 -> sort_index or sort_values()
df['new_rank'] = [10, 100, 30]

df.sort_values(by='new_rank', ascending=False) # 어센딩 펄스로 하면 내림차순

  country grade  rank  new_rank
1     usa  pass     2       100
2     chn  pass     3        30
0     kor  pass     1        10

In [53]:
# null 데이터(NaN) 처리
# isNull() -> 데이터의 null 여부
# fillna() -> null 데이터를 채움
# dropna() -> null 데이터 삭제

import numpy as np
df.loc[1, 'grade'] = np.nan

df['grade'] = np.nan
df.fillna(value='pass', inplace=True)
df

C:\Users\박민호\AppData\Local\Temp\ipykernel_7552\3483594393.py:10: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'pass' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df.fillna(value='pass', inplace=True)

  country grade  rank  new_rank
0     kor  pass     1        10
1     usa  pass     2       100
2     chn  pass     3        30

In [58]:
df.loc[1, 'grade'] = np.nan

In [59]:
df.dropna(how='any')

  country grade  rank  new_rank
0     kor  pass     1        10
2     chn  pass     3        30

## Pandas 실습

In [60]:
json_data = {
  "columns": ["Movie", "Release Year", "Audience", "Rating"],
  "index": [0, 1, 2, 3, 4, 5, 6, 7],
  "data": [
    ["Avengers", 2012, 1500, 8.8],
    ["Interstellar", 2014, 1100, 9.1],
    ["Frozen", 2013, 1020, 8.5],
    ["About Time", 2013, 950, 8.7],
    ["The Dark Knight", 2008, 1300, 9.0],
    ["Inception", 2010, 1200, 8.8],
    ["La La Land", 2016, 800, 8.6],
    ["Toy Story", 2010, 980, 8.5]
  ]
}

# JSON 데이터를 DataFrame으로 변환
df = pd.DataFrame(json_data['data'], columns=json_data['columns'])
df

             Movie  Release Year  Audience  Rating
0         Avengers          2012      1500     8.8
1     Interstellar          2014      1100     9.1
2           Frozen          2013      1020     8.5
3       About Time          2013       950     8.7
4  The Dark Knight          2008      1300     9.0
5        Inception          2010      1200     8.8
6       La La Land          2016       800     8.6
7        Toy Story          2010       980     8.5

연습문제 1) 전체 데이터 중에서 'Moive' 정보만 출력하시오.

In [61]:
df.Movie

0           Avengers
1       Interstellar
2             Frozen
3         About Time
4    The Dark Knight
5          Inception
6         La La Land
7          Toy Story
Name: Movie, dtype: object

연습문제 2) 전체 데이터 중에서 'Movie','Rating' 정보를 출력하시오.

In [62]:
df[['Movie', 'Rating']]

             Movie  Rating
0         Avengers     8.8
1     Interstellar     9.1
2           Frozen     8.5
3       About Time     8.7
4  The Dark Knight     9.0
5        Inception     8.8
6       La La Land     8.6
7        Toy Story     8.5

연습문제 3) 2013년 이후에 개봉한 영화 데이터 중에서 'Movie','Rating' 정보를 출력하시오.

In [65]:
df[df['Release Year'] > 2013] [['Movie', 'Rating']]

          Movie  Rating
1  Interstellar     9.1
6    La La Land     8.6

연습문제 4) 주어진 계산식을 참고하여 'Recommend' Column을 추가하시오.

Recommend = (Audience * Rating) // 100

In [71]:
df['Recommend'] = (df['Audience'] * df['Rating']) // 100

df.sort_values(by='Recommend', ascending=False).head(5) # 추천지수값이 높은 상위 5개만 출력 (어센딩은 내림차순, head의 값만큼 갯수 표출)

             Movie  Release Year  Audience  Rating  Recommend
0         Avengers          2012      1500     8.8      132.0
4  The Dark Knight          2008      1300     9.0      117.0
5        Inception          2010      1200     8.8      105.0
1     Interstellar          2014      1100     9.1      100.0
2           Frozen          2013      1020     8.5       86.0